package com.telran.lessons.lesson05;

//Создайте новый простой проект compilation-java
//Создайте класс TestCompilation.java
//Создайте метод main
//Добавьте инструкцию System.out.println(“Compilation was successful”)
//Откройте терминал в папке где вы создали класс из п. 1
//Скомпилируйте код - введите команду: javac TestCompilation.java
//Запустите java-программу командой: java TestCompilation

public class TestCompilation {
    public static void main(String[] args) {
        System.out.println("Compilation was successful!");
    }
}
